{
    "title": "About Me",
    "p1": "I'm fascinated with the gap between tools that could work, and tools that actually do. The practice app with impressive algorithms, if you can figure out mic placement first. The online course platform that assumes the knitting teacher wants to become a web developer. The \"easy-to-use\" software that doesn't anticipate whether its user is in the mental space to learn it right now.",
    "p2": "I build things in the worlds of music, language, and technology because those are spaces where I keep noticing the same pattern: we build impressive features, but rarely stop to ask whether anyone actually needs them; whether they build on what users already know, or whether they just create new problems to solve.",
    "p3": "Most recently, I led the 9-month digital transformation for Kuang-Hwa Vocational Senior High School, a 70-year-old institution my grandfather founded. The school was using an expensive, dated website that locked them into a generic template. I oversaw a complete overhaul and modernization: migrating from their legacy system to a flexible, cost-effective setup on WordPress/Elementor hosted on GCP, coordinating with designers and school stakeholders to give the school a site they could actually own and update themselves, without needing developers for every typo.",
    "p4": "Right now, I'm continuing to explore what actually makes tools useful through two projects:",
    "p4a": "SceneSync: Exploring whether AI can help film editors find temp music by analyzing audio features, not just categories. With 20 training tracks (50% accuracy), I'm learning where the real challenges are.",
    "p4b": "PollyGlot: Because Google Translate gives you words, but it doesn't help with tone. Formal, friendly, or slang across 9 languages. Including Klingon – because why not?",
    "p5": "<span class=\"value-highlight\">I'm less interested in building things \"because we can\" and more interested in anticipating needs before users realize they have them.</span> That means I spot the frictions that are often missed: the reasons adoption stalls, the cognitive load that turns good tools into chores, and the ever-fascinating gap between what we build and what people actually use. Whether I'm leading a digital transformation or prototyping a new idea, <span class=\"value-highlight\">I help teams build things that don't just work. They work seamlessly for the people using them.</span>",
    "highlight_projects": [
        {"name": "SceneSync", "anchor": "#project-1"},
        {"name": "Kuang-Hwa Vocational Senior High School", "anchor": "#project-2"},
        {"name": "PollyGlot", "anchor": "#project-3"}
    ],
    "timeline": [
        {
            "label": "Music Teaching",
            "detail": "Saw EdTech gaps",
            "highlight": false
        },
        {
            "label": "Flatiron School",
            "detail": "Learned to think in Swift",
            "highlight": false
        },
        {
            "label": "MusicFirst",
            "detail": "+21.9% renewals",
            "highlight": true
        },
        {
            "label": "Teachable",
            "detail": "Listened. Synthesized. Advocated.",
            "highlight": false
        },
        {
            "label": "Grace Hopper",
            "detail": "Full-stack intensive",
            "highlight": false
        },
        {
            "label": "BORN Group",
            "detail": "Shipped enterprise React • Mentored juniors • Lifted conversion",
            "highlight": false
        },
        {
            "label": "Kuang-Hwa",
            "detail": "Legacy → ownership in 9 months",
            "highlight": true
        },
        {
            "label": "Now",
            "detail": "Exploring what's next",
            "highlight": false
        }
    ]
}